benchmarks/lora/definitive_results/performance_analysis/memory_overhead/llama-2-7b/p25_dataset/_512_8_/log_12847514.out
WARNING 12-10 09:51:05 _custom_ops.py:14] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=40384, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p25.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=4000, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/theory/S/llama-2-7b/p25_dataset/_512_8_', launch_server=True, server_args='--port=40384 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --enable-lora --max-num-seqs=4096 --max-loras=512 --max-lora-rank=8', disable_log_stats=False, disable_loras_users=True, user_lora_request_relation=None, infinite_behaviour=False, restrict_loras=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     4000      
Benchmark duration (s):                  36.39     
Total input tokens:                      92000     
Total generated tokens:                  108000    
Request throughput (req/s):              109.93    
Input token throughput (tok/s):          2528.38   
Output token throughput (tok/s):         2968.10   
---------------Time to First Token----------------
Mean TTFT (ms):                          16128.20  
Median TTFT (ms):                        17330.06  
P99 TTFT (ms):                           31131.68  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          264.85    
Median TPOT (ms):                        247.26    
P99 TPOT (ms):                           429.55    
---------------Inter-token Latency----------------
Mean ITL (ms):                           264.27    
Median ITL (ms):                         144.60    
P99 ITL (ms):                            1574.09   
==================================================
Concurrent checker terminated
Server terminated